# Лабораторная работа 8
# Задание A: Автомобильные номера региона X

import random
import string

def generate_license_plate():
    """
    Генерирует случайный автомобильный номер
    """
    # Ваша реализация здесь
    pass

if __name__ == "__main__":
    for i in range(1, 6):
        print(f"Тест {i}: {generate_license_plate()}")