# Лабораторная работа 8
# Задание H: Анализ продаж магазина

def sales_summary(price_list, sales):
    """
    Анализирует продажи магазина и возвращает сводку

    Параметры:
        price_list (dict): словарь с ценами товаров
        sales (list): список продаж в формате (товар, количество)

    Возвращает:
        dict: сводка с общей выручкой, проданными товарами и топ-товаром
    """



if __name__ == "__main__":
    price_list = {"Хлеб": 50, "Молоко": 80, "Сыр": 200}
    sales = [("Хлеб", 3), ("Молоко", 2), ("Хлеб", 1), ("Кофе", 5)]
    result = sales_summary(price_list, sales)
    print("Тест 1:")
    print(result)

    # Тест 2: Только неизвестные товары
    price_list2 = {"Хлеб": 50, "Молоко": 80}
    sales2 = [("Чай", 2), ("Кофе", 3)]
    result2 = sales_summary(price_list2, sales2)
    print("\nТест 2 (только неизвестные товары):")
    print(result2)

    # Тест 3: Нет продаж
    price_list3 = {"Хлеб": 50, "Молоко": 80}
    sales3 = []
    result3 = sales_summary(price_list3, sales3)
    print("\nТест 3 (нет продаж):")
    print(result3)

    # Тест 4: Несколько товаров с одинаковым количеством продаж
    price_list4 = {"Хлеб": 50, "Молоко": 80, "Сыр": 200}
    sales4 = [("Хлеб", 2), ("Молоко", 2), ("Сыр", 1)]
    result4 = sales_summary(price_list4, sales4)
    print("\nТест 4 (одинаковое количество продаж):")
    print(result4)